---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstraint.ConstrainsRebarEnds
source: html/9d8dc518-0093-3aa8-dc50-26e85df9bf50.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraint.ConstrainsRebarEnds Method

Returns true if this constraint constrains two rebar ends.

## Syntax (C#)
```csharp
public bool ConstrainsRebarEnds()
```